routes/web.php

select `subsections`.*, (select count(*) from `documents` where `subsections`.`id` = `documents`.`subsection_id`) as `documents_count` from `subsections`
select count(*) as aggregate from `divisions`
select count(*) as aggregate from `persons_in_charge`
select count(*) as aggregate from `document_status`
select count(*) as aggregate from `documents`
select count(*) as aggregate from `documents` where `uploaded_by` = 1
---
});

// Dashboard Route
Route::get('/dashboard', function () {
    $userCount = User::count();
    $divisionCount = Division::count();
    $picCount = PersonInCharge::count();
    $documentStatusCount = DocumentStatus::count();
    $documentCount = Document::count();

    // Hitung total dokumen per subseksi
    $subsectionsWithDocumentCount = Subsection::withCount('documents')->get();

    // Hitung total dokumen yang diunggah oleh pengguna yang sedang login
    $uploadedDocumentsCount = Document::where('uploaded_by', auth()->user()->id)->count();

    return view('dashboard', [
        'userCount' => $userCount,
        'divisionCount' => $divisionCount,
        'picCount' => $picCount,
        'documentStatusCount' => $documentStatusCount,
        'documentCount' => $documentCount,
        'subsectionsWithDocumentCount' => $subsectionsWithDocumentCount,
        'uploadedDocumentsCount' => $uploadedDocumentsCount,