app/Http/Controllers/ClassificationCodeController.php

select * from `classification_codes`
---
    public function index()
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        if (request()->ajax()) {
            // Menggunakan cache untuk data DocumentStatus
            $data = Cache::remember('classification_codes', 60, function () {
                return ClassificationCode::query()->get();
            });

select * from `classification_codes`
---
        }

        // Pass all classification codes to the view
        $classificationCodes = ClassificationCode::all();