app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `divisions`
select count(*) as aggregate from `persons_in_charge`
select count(*) as aggregate from `document_status`
select count(*) as aggregate from `documents`
select count(*) as aggregate from `subsections`
select count(*) as aggregate from `classification_codes`
select count(*) as aggregate from `documents` where `subsection_id` is null
select count(*) as aggregate from `documents` where `uploaded_by` = 1
---
    public function index()
    {
        $userCount = User::count();
        $divisionCount = Division::count();
        $picCount = PersonInCharge::count();
        $documentStatusCount = DocumentStatus::count();
        $documentCount = Document::count();

        $subsectionCount = Subsection::count();
        $classificationCodeCount = ClassificationCode::count();
        $subsectionsWithDocumentCount = Subsection::withCount('documents')->get();
        $documentsWithoutSubsectionCount = Document::whereNull('subsection_id')->count();

        return view('dashboard', [
            'userCount' => $userCount,
            'divisionCount' => $divisionCount,
            'picCount' => $picCount,
            'documentStatusCount' => $documentStatusCount,
            'documentCount' => $documentCount,
            'subsectionsWithDocumentCount' => $subsectionsWithDocumentCount,
            'uploadedDocumentsCount' => Document::where('uploaded_by', Auth::id())->count(),
            'subsectionCount' => $subsectionCount,
            'classificationCodeCount' => $classificationCodeCount,
            'documentsWithoutSubsectionCount' => $documentsWithoutSubsectionCount,
        ]);