app/Http/Controllers/DivisionController.php

select `subsections`.*, `division_subsection`.`division_id` as `pivot_division_id`, `division_subsection`.`subsection_id` as `pivot_subsection_id` from `subsections` inner join `division_subsection` on `subsections`.`id` = `division_subsection`.`subsection_id` where `division_subsection`.`division_id` = 1
---
    public function index()
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        if (request()->ajax()) {
            $data = Division::with('subsections'); // Use eager loading for subsections

            return DataTables::of($data)
                ->addIndexColumn() // Adds the DT_RowIndex column
                ->addColumn('subsections', function ($row) {
                    return $row->subsections->pluck('name')->map(function ($name) {
                        return '<span class="badge bg-secondary">' . $name . '</span>';
                    })->implode(' ');
                })
                ->addColumn('action', function ($row) {