app/Http/Controllers/DivisionController.php

    public function getSubsections($divisionId)
    {
        $subsections = Subsection::whereHas('divisions', function ($query) use ($divisionId) {
            $query->where('division_id', $divisionId);
        })->get();
---
select * from `divisions`

    public function index()
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        if (request()->ajax()) {
            // Menggunakan cache untuk data divisions dengan subsections
            $data = Cache::remember('divisions_with_subsections', 60, function () {
                return Division::with('subsections')->get();
            });

            return DataTables::of($data)
                ->addIndexColumn() // Adds the DT_RowIndex column
                ->addColumn('subsections', function ($row) {
                    return $row->subsections->pluck('name')->map(function ($name) {
                        return '<span class="badge bg-secondary">' . $name . '</span>';
                    })->implode(' ');
                })
                ->addColumn('action', function ($row) {
---
select * from `divisions`
select `subsections`.*, `division_subsection`.`division_id` as `pivot_division_id`, `division_subsection`.`subsection_id` as `pivot_subsection_id` from `subsections` inner join `division_subsection` on `subsections`.`id` = `division_subsection`.`subsection_id` where `division_subsection`.`division_id` in (1)
select `subsections`.*, `division_subsection`.`division_id` as `pivot_division_id`, `division_subsection`.`subsection_id` as `pivot_subsection_id` from `subsections` inner join `division_subsection` on `subsections`.`id` = `division_subsection`.`subsection_id` where `division_subsection`.`division_id` = 2

        }

        // Menggunakan cache untuk daftar divisions
        $divisions = Cache::remember('divisions', 60, function () {
            return Division::all();
        });
---
select * from `divisions`

    public function create()
    {
        // Menggunakan cache untuk daftar subsections
        $subsections = Cache::remember('subsections', 60, function () {
            return Subsection::all();
        });
---
select * from `subsections`