app/Http/Controllers/DocumentController.php

select `name`, `id` from `users`
select `name`, `id` from `persons_in_charge`
select `name`, `id` from `classification_codes`
select * from `documents` where `documents`.`id` = '1' limit 1
---
    public function index(Request $request)
    {
        $statuses = DocumentStatus::pluck('status', 'id'); // Atau nama kolom yang sesuai
        $uploaders = User::pluck('name', 'id'); // Assuming 'name' is the field you want to display in the dropdown
        $personsInCharge = PersonInCharge::pluck('name', 'id'); // Assuming you want the same field for PIC
        $classificationCodes = ClassificationCode::pluck('name', 'id'); // Assuming you have a ClassificationCode model

        if (request()->ajax()) {
            $query = Document::with([
                'classificationCode',
                'personInCharge',
                'documentStatus',
                'uploader',
            ]);

            // Apply filters
            if ($request->has('status') && $request->status) {
                $query->whereHas('documentStatus', function ($q) use ($request) {
                    $q->where('id', $request->status);
                });

select * from `document_status`
select * from `divisions`
select * from `subsections`
select * from `classification_codes`
select * from `persons_in_charge`
---
    public function create()
    {
        // Ambil data dari database
        $personsInCharge = PersonInCharge::all();
        $documentStatuses = DocumentStatus::all();
        $classificationCodes = ClassificationCode::all();
        $divisions = Division::all();
        $subsections = Subsection::all();

        // Ambil data pengguna yang sedang login
        $user = auth()->user();
        $userDivision = $user->division; // Asumsi bahwa user memiliki relasi `division`
        $userSubsections = $user->subsections; // Asumsi bahwa user memiliki relasi `subsections`

        // Cek apakah semua data relasi ada
        $allDataAvailable = [
            'Kode Klasifikasi' => $classificationCodes->count() > 0,
            'Sifat Dokumen' => $documentStatuses->count() > 0,
            'PIC (Person In Charge)' => $personsInCharge->count() > 0,
            'Jabatan Untuk Pegawai' => $userDivision !== null,
            'Sub Bagian Untuk Pegawai' => $userSubsections->count() > 0
        ];

insert into `documents` (`number`, `title`, `description`, `file_path`, `document_creation_date`, `uploaded_by`, `person_in_charge_id`, `document_status_id`, `classification_code_id`, `subsection_id`, `updated_at`, `created_at`) values ('04', '04', '04', 'documents/reload(1).png', '2024-07-31', 1, '1', '1', '1', 1, '2024-07-31 03:24:23', '2024-07-31 03:24:23')
---
    public function store(Request $request)
    {
        // Validasi input dari pengguna
        $validatedData = $request->validate([
            'number' => 'required|string|max:255',
            'title' => 'required|string|max:255',
            'description' => 'nullable|string|max:225',
            'file' => 'required|file',
            'document_creation_date' => 'required|date_format:d-m-Y', // Validasi format d-m-Y
            'person_in_charge_id' => 'required|exists:persons_in_charge,id',
            'document_status_id' => 'nullable|exists:document_status,id',
            'classification_code_id' => 'nullable|exists:classification_codes,id',
        ]);

        // Konversi format tanggal dari d-m-Y ke Y-m-d
        $documentCreationDate = \Carbon\Carbon::createFromFormat('d-m-Y', $validatedData['document_creation_date'])->format('Y-m-d');

select `subsections`.*, `subsection_user`.`user_id` as `pivot_user_id`, `subsection_user`.`subsection_id` as `pivot_subsection_id` from `subsections` inner join `subsection_user` on `subsections`.`id` = `subsection_user`.`subsection_id` where `subsection_user`.`user_id` = 1
---
        $user = auth()->user();

        // Retrieve the user's subsections and choose the first one or null if none exist
        $subsectionId = $user->subsections->first()->id ?? null;