app/Http/Controllers/DocumentStatusController.php

    public function index()
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }
        $documentStatuses = DocumentStatus::all();
---
select * from `document_status`