app/Http/Controllers/DocumentController.php

select * from `classification_codes` where `classification_codes`.`id` in (1)
select * from `document_status` where `document_status`.`id` in (2)
select * from `documents` where `documents`.`deleted_at` is null
select * from `persons_in_charge` where `persons_in_charge`.`id` in (1)
select count(*) as aggregate from `subsections`
select count(*) as aggregate from `divisions`
select count(*) as aggregate from `document_status`
select count(*) as aggregate from `persons_in_charge`
select * from `documents` order by `id` desc limit 1
---
    public function index()
    {
        $user = Auth::user();

        // Mengambil semua dokumen dengan eager loading untuk relasi yang diperlukan
        $documents = Document::with([
            'classificationCode',
            'personInCharge',
            'documentStatus',
            'subsection',
            'uploader' // Eager load the uploadedBy relationship
        ])->get();

        // Mengambil divisi dari pengguna yang sedang login
        $userDivision = $user->division;

        // Cek apakah semua relasi ada
        $allDataAvailable = [
            'classificationCodes' => ClassificationCode::count() > 0,
            'personsInCharge' => PersonInCharge::count() > 0,
            'documentStatuses' => DocumentStatus::count() > 0,
            'divisions' => Division::count() > 0,
            'subsections' => Subsection::count() > 0
        ];

        foreach ($allDataAvailable as $key => $value) {
            if (!$value) {
                return redirect()->route('documents.create')
                ->with('error', "Belum ada $key");

select * from `persons_in_charge`
select * from `document_status`
select * from `classification_codes`
select * from `divisions`
---
    public function create()
    {
        $personsInCharge = PersonInCharge::all();
        $documentStatuses = DocumentStatus::all();
        $classificationCodes = ClassificationCode::all();
        $divisions = Division::all();

select * from `divisions`
select * from `subsections`
select * from `document_status`
select * from `classification_codes`
select * from `persons_in_charge`
---
    public function edit($id)
    {
        $document = Document::findOrFail($id);
        $divisions = Division::all();
        $subsections = Subsection::all();
        $documentStatuses = DocumentStatus::all();
        $classificationCodes = ClassificationCode::all();
        $personsInCharge = PersonInCharge::all();

select * from `documents` where `documents`.`id` = '1' limit 1
---
    public function show(Request $request, $id)
    {
        $request->validate([
            'id' => 'required|integer|exists:documents,id',
        ]);

        $document = Document::findOrFail($id);

select * from `subsections`
---
    public function store(Request $request)
    {
        // Validasi input dari pengguna
        $validatedData = $request->validate([
            'title' => 'required|string|max:255',
            'description' => 'nullable|string',
            'file' => 'required|file',
            'document_creation_date' => 'required|date',
            'person_in_charge_id' => 'required|exists:persons_in_charge,id',
            'document_status_id' => 'nullable|exists:document_status,id',
            'classification_code_id' => 'nullable|exists:classification_codes,id',
        ]);

        // Handle file upload
        $file = $request->file('file');
        $filename = $file->getClientOriginalName(); // Get the original file name
        $path = $file->storeAs('documents', $filename, 'public'); // Store file with original name

        // Get current user
        $user = auth()->user();

        // Retrieve the user's subsections and choose the first one or null if none exist
        $subsectionId = $user->subsections->first()->id ?? null;