app/Http/Controllers/DocumentController.php

    public function create()
    {
        // Ambil data dari database
        $personsInCharge = PersonInCharge::all();
        $documentStatuses = DocumentStatus::all();
        $classificationCodes = ClassificationCode::all();
        $divisions = Division::all();
        $subsections = Subsection::all();

        // Ambil data pengguna yang sedang login
        $user = auth()->user();
        $userDivision = $user->division; // Asumsi bahwa user memiliki relasi `division`
        $userSubsections = $user->subsections; // Asumsi bahwa user memiliki relasi `subsections`

        // Cek apakah semua data relasi ada
        $allDataAvailable = [
            'Kode Klasifikasi' => $classificationCodes->count() > 0,
            'Sifat Dokumen' => $documentStatuses->count() > 0,
            'PIC (Person In Charge)' => $personsInCharge->count() > 0,
            'Jabatan' => $userDivision !== null,
            'Sub Bagian' => $userSubsections->count() > 0
        ];
---
select * from `persons_in_charge`
select * from `document_status`
select * from `classification_codes`
select * from `divisions`
select * from `subsections`
select count(*) as aggregate from `classification_codes`
select count(*) as aggregate from `persons_in_charge`
select count(*) as aggregate from `document_status`
select count(*) as aggregate from `divisions`

        $user = auth()->user();

        // Retrieve the user's subsections and choose the first one or null if none exist
        $subsectionId = $user->subsections->first()->id ?? null;
---
select `subsections`.*, `subsection_user`.`user_id` as `pivot_user_id`, `subsection_user`.`subsection_id` as `pivot_subsection_id` from `subsections` inner join `subsection_user` on `subsections`.`id` = `subsection_user`.`subsection_id` where `subsection_user`.`user_id` = 1

    public function show($id)
    {
        $document = Document::with([
            'classificationCode',
            'personInCharge',
            'uploader.division', // Memuat relasi division dari uploader
            'subsection',
            'documentStatus',
        ])->findOrFail($id);
---
select * from `classification_codes` where `classification_codes`.`id` in (1)
select * from `divisions` where `divisions`.`id` in (1)
select * from `document_status` where `document_status`.`id` in (1)
select * from `documents` where `documents`.`id` = '1' limit 1