app/Http/Controllers/EmployeeController.php

    public function edit(User $employee)
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        $divisions = Division::all();
---
select * from `divisions`