app/Http/Controllers/EmployeeController.php

    public function edit(User $employee)
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            return redirect()->route('home')
                ->with('error', 'Unauthorized action.');
        }

        $divisions = Division::all();
        $subsections = Subsection::all(); // Fetch all subsections
---
select * from `subsections`