app/Http/Controllers/EmployeeController.php

    public function index()
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        if (request()->ajax()) {
            $data = User::with(['division', 'subsections'])->get();

            return DataTables::of($data)
                ->addIndexColumn() // Adds the DT_RowIndex column
                ->addColumn('subsections', function ($row) {
                    return $row->subsections->pluck('name')->implode(', ');
                })
                ->addColumn('action', function ($row) {
                    $editUrl = route('employees.edit', $row->id);
                    $deleteUrl = route('employees.destroy', $row->id);

                    return '
                <div class="dropdown dropup">
                    <button class="btn btn-secondary dropdown-toggle btn-sm mt-2 mb-2 ms-2 me-2" type="button" id="dropdownMenuButton-' . $row->id . '" data-bs-toggle="dropdown" aria-expanded="false">
                        Actions
                    </button>
                    <ul class="dropdown-menu" aria-labelledby="dropdownMenuButton-' . $row->id . '">
                        <li><a href="' . $editUrl . '" class="dropdown-item" data-bs-toggle="tooltip" data-bs-placement="top" title="Edit">
                            <i class="bi bi-pencil"></i> Edit
                        </a></li>
                        <li><button type="button" class="dropdown-item" data-bs-toggle="modal" data-bs-target="#deleteModal"  data-bs-placement="top" title="Delete" data-id="' . $row->id . '" data-name="' . $row->name . '">
                            <i class="bi bi-trash"></i> Delete
                        </button></li>
---
select * from `divisions` where `divisions`.`id` in (1)
select * from `users`
select `subsections`.*, `subsection_user`.`user_id` as `pivot_user_id`, `subsection_user`.`subsection_id` as `pivot_subsection_id` from `subsections` inner join `subsection_user` on `subsections`.`id` = `subsection_user`.`subsection_id` where `subsection_user`.`user_id` in (1, 2)
select * from `divisions` where `divisions`.`id` in ('a63ae094-91db-433f-b095-b282ad67eb8b', 'c68914f4-e870-468d-a6bf-f0a924b01558', 'e7970af3-770b-431b-8e0a-7817adf0e83b')
select `subsections`.*, `subsection_user`.`user_id` as `pivot_user_id`, `subsection_user`.`subsection_id` as `pivot_subsection_id` from `subsections` inner join `subsection_user` on `subsections`.`id` = `subsection_user`.`subsection_id` where `subsection_user`.`user_id` in ('04b050d6-d26f-4cc2-854f-4e8129973160', '2d19db0b-267b-40a3-b70d-ba55ec207d31', '55dda4e5-1a02-420e-8b1f-052e85cafad8', '7f24538a-380f-421c-9c86-897256135f67')

    public function edit(User $employee)
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        $divisions = Division::all();
---
select * from `divisions`

    public function update(Request $request, $id)
    {
        // Cek apakah pengguna yang sedang login adalah admin
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        // Validasi input
        $validatedData = $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|email|max:255|unique:users,email,' . $id,
            'password' => 'nullable|confirmed|min:8',
            'phone' => 'required|string|max:20',
            'date_of_birth' => 'required|date',
            'gender' => 'required|in:male,female,other',
            'role' => 'required|in:user,admin',
            'division_id' => 'required|exists:divisions,id',
            'subsections' => 'required|array',
            'subsections.*' => 'exists:subsections,id',
        ]);

        // Temukan karyawan berdasarkan ID
        $employee = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '1' limit 1

        $employee->subsections()->sync($validatedData['subsections']);

        // Update subsection_id pada dokumen yang diunggah oleh pengguna ini
        Document::where('uploaded_by', $employee->id)
            ->update(['subsection_id' => $validatedData['subsections'][0] ?? null]); // Pilih subseksi pertama atau null jika tidak ada subseksi
---
update `documents` set `subsection_id` = '1', `documents`.`updated_at` = '2024-07-25 14:27:18' where `uploaded_by` = 1