app/Http/Controllers/PersonInChargeController.php

    public function index()
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        if (request()->ajax()) {
            // Menggunakan cache untuk data PersonInCharge
            $data = Cache::remember('person_in_charge', 60, function () {
                return PersonInCharge::query()->get();
            });
---
select * from `persons_in_charge`