app/Http/Controllers/SubsectionController.php

    public function index(Request $request)
    {
        if (auth()->check() && auth()->user()->role !== 'admin') {
            abort(403, 'Unauthorized action.');
        }

        if ($request->ajax()) {
            // Menambahkan cache untuk data subsections
            $data = Cache::remember('subsections', 60, function () {
                return Subsection::all();
            });
---
select * from `subsections`